{"pageProps":{"variables":{"relativePath":"our-obsession-with-security.md"},"data":{"post":{"_sys":{"filename":"our-obsession-with-security","basename":"our-obsession-with-security.md","breadcrumbs":["our-obsession-with-security"],"path":"posts/our-obsession-with-security.md","relativePath":"our-obsession-with-security.md","extension":".md"},"id":"posts/our-obsession-with-security.md","__typename":"Post","title":"Our Obsession with Security","body":{"type":"root","children":[{"type":"p","children":[{"type":"text","text":"We already talked about our biggest security advantage in "},{"type":"a","url":"the-benefits-of-sass-without-the-downsides","title":null,"children":[{"type":"text","text":"The Benefits of SaaS without the Downsides"}]},{"type":"text","text":". But we didn’t stop there."}]},{"type":"h2","children":[{"type":"text","text":"Security features in EdgeSet"}]},{"type":"p","children":[{"type":"text","text":"EdgeSet is designed from the ground up to protect your data:"}]},{"type":"ul","children":[{"type":"li","children":[{"type":"lic","children":[{"type":"text","text":"EdgeSet stores data source credentials (passwords and keys) encrypted. It uses the ChaCha20 cipher designed by the legendary cryptographer DJ Bernstein and selected by Google for use in HTTP/3."}]}]},{"type":"li","children":[{"type":"lic","children":[{"type":"text","text":"Every EdgeSet instance uses a unique encryption key (and we will soon introduce a feature to allow you to set your own encryption passphrase). Reverse engineering the EdgeSet source code does not allow attackers to decrypt your credentials."}]}]},{"type":"li","children":[{"type":"lic","children":[{"type":"text","text":"EdgeSet uses a type system to guarantee that any sensitive data (i.e. credentials) are automatically scrubbed from memory when they go out of scope. This, combined with other techniques, prevent unencrypted data from being accidentally written to disk."}]}]},{"type":"li","children":[{"type":"lic","children":[{"type":"text","text":"EdgeSet does not transparently cache any data from your data sources. The only data that is held on disk are data for saved queries and visualizations (which are usually aggregated non-identifiable data)."}]}]},{"type":"li","children":[{"type":"lic","children":[{"type":"text","text":"All user passwords are hashed with individual salts using a modern memory-hard hashing function with GPU resistance."}]}]},{"type":"li","children":[{"type":"lic","children":[{"type":"text","text":"EdgeSet does not run OpenSSH or allow shell logins of any kind. It does provide a terminal interface that operates over the SSH protocol, but it cannot be escaped to a shell."}]}]},{"type":"li","children":[{"type":"lic","children":[{"type":"text","text":"The permissions system (which allows for granting or blocking access down to the column level) applies safe defaults: users are not automatically granted access, even to new data sources."}]}]}]},{"type":"h2","children":[{"type":"text","text":"Security controls in Tetmon"}]},{"type":"p","children":[{"type":"text","text":"It’s not enough to design security into the product, we also secure the process of building the product and our software supply chain:"}]},{"type":"ul","children":[{"type":"li","children":[{"type":"lic","children":[{"type":"text","text":"We review software dependencies (i.e. open source libraries) before inclusion and then “pin” them to a cryptographic hash. Since EdgeSet is built entirely via Nix in a “clean room” environment, no unverified software or data can enter the final product."}]}]},{"type":"li","children":[{"type":"lic","children":[{"type":"text","text":"We review all code commits to our Git repositories, and commits are cryptographically signed by our developers."}]}]},{"type":"li","children":[{"type":"lic","children":[{"type":"text","text":"We host our own Git and CI/CD (Continuous Integration/Continuous Deployment) servers, rather than trust third-party services not to be compromised. These servers store credentials in RAM only, to mitigate the risk of attacks against the physical hardware. All system software is mounted read-only and verified with cryptographic hashes."}]}]},{"type":"li","children":[{"type":"lic","children":[{"type":"text","text":"Our developers do not have SSH access to build servers. For code to make it through the build process, it must go through the Git approval process."}]}]},{"type":"li","children":[{"type":"lic","children":[{"type":"text","text":"Before new EdgeSet builds are made available, they are automatically tested inside various simulated networks. The tests not only test the correctness and proper functioning of EdgeSet features, but they also test that the permissions system cannot be circumvented. These tests cannot be bypassed."}]}]},{"type":"li","children":[{"type":"lic","children":[{"type":"text","text":"Finally, when new versions of EdgeSet ship, they are cryptographically signed. EdgeSet verifies all updates using an embedded public key, and administrators have full control over whether or not to apply updates."}]}]}]},{"type":"p","children":[{"type":"text","text":"If you need military-grade security, contact us about our enterprise license that allows you to run EdgeSet on an air-gapped network.","bold":true}]}]}}},"query":"\n    query post($relativePath: String!) {\n  post(relativePath: $relativePath) {\n    ... on Document {\n      _sys {\n        filename\n        basename\n        breadcrumbs\n        path\n        relativePath\n        extension\n      }\n      id\n    }\n    ...PostParts\n  }\n}\n    \n    fragment PostParts on Post {\n  __typename\n  title\n  body\n}\n    "},"__N_SSG":true}